www/php/XOLTResult.xml

Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/Rate/v1.1" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>janpaul.sanchez</ns3:Username><ns3:Password>Welcome1!</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>1CEA1F8720EA71B6</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:RateRequest><ns1:Request><ns1:RequestOption>Shop</ns1:RequestOption></ns1:Request><ns2:PickupType><ns2:Code>01</ns2:Code><ns2:Description>Daily Pickup</ns2:Description></ns2:PickupType><ns2:CustomerClassification><ns2:Code>01</ns2:Code><ns2:Description>Classfication</ns2:Description></ns2:CustomerClassification><ns2:Shipment><ns2:Shipper><ns2:Name>Imani Carr</ns2:Name><ns2:ShipperNumber>222006</ns2:ShipperNumber><ns2:Address><ns2:AddressLine>Southam Rd</ns2:AddressLine><ns2:AddressLine>4 Case Cour</ns2:AddressLine><ns2:AddressLine>Apt 3B</ns2:AddressLine><ns2:City>Timonium</ns2:City><ns2:StateProvinceCode>MD</ns2:StateProvinceCode><ns2:PostalCode>21093</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:Shipper><ns2:ShipTo><ns2:Name>Imani Imaginarium</ns2:Name><ns2:Address><ns2:AddressLine>67</ns2:AddressLine><ns2:City>ALISO VIEJO</ns2:City><ns2:StateProvinceCode>MO</ns2:StateProvinceCode><ns2:PostalCode>631053</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode><ns2:ResidentialAddressIndicator></ns2:ResidentialAddressIndicator></ns2:Address></ns2:ShipTo><ns2:ShipFrom><ns2:Name>Imani Imaginarium</ns2:Name><ns2:Address><ns2:AddressLine>Southam Rd</ns2:AddressLine><ns2:AddressLine>4 Case Court</ns2:AddressLine><ns2:AddressLine>Apt 3B</ns2:AddressLine><ns2:City>Timonium</ns2:City><ns2:StateProvinceCode>MD</ns2:StateProvinceCode><ns2:PostalCode>21093</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipFrom><ns2:Service><ns2:Code>03</ns2:Code><ns2:Description>Service Code</ns2:Description></ns2:Service><ns2:Package><ns2:PackagingType><ns2:Code>02</ns2:Code><ns2:Description>Rate</ns2:Description></ns2:PackagingType><ns2:Dimensions><ns2:UnitOfMeasurement><ns2:Code>IN</ns2:Code><ns2:Description>inches</ns2:Description></ns2:UnitOfMeasurement><ns2:Length>5</ns2:Length><ns2:Width>4</ns2:Width><ns2:Height>10</ns2:Height></ns2:Dimensions><ns2:PackageWeight><ns2:UnitOfMeasurement><ns2:Code>LBS</ns2:Code><ns2:Description>Pounds</ns2:Description></ns2:UnitOfMeasurement><ns2:Weight>1</ns2:Weight></ns2:PackageWeight></ns2:Package><ns2:Package><ns2:PackagingType><ns2:Code>02</ns2:Code><ns2:Description>Rate</ns2:Description></ns2:PackagingType><ns2:Dimensions><ns2:UnitOfMeasurement><ns2:Code>IN</ns2:Code><ns2:Description>inches</ns2:Description></ns2:UnitOfMeasurement><ns2:Length>3</ns2:Length><ns2:Width>5</ns2:Width><ns2:Height>8</ns2:Height></ns2:Dimensions><ns2:PackageWeight><ns2:UnitOfMeasurement><ns2:Code>LBS</ns2:Code><ns2:Description>Pounds</ns2:Description></ns2:UnitOfMeasurement><ns2:Weight>2</ns2:Weight></ns2:PackageWeight></ns2:Package><ns2:ShipmentServiceOptions/></ns2:Shipment></ns2:RateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><rate:RateResponse xmlns:rate="http://www.ups.com/XMLSchema/XOLTWS/Rate/v1.1"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus><common:Alert><common:Code>110971</common:Code><common:Description>Your invoice may vary from the displayed reference rates</common:Description></common:Alert><common:TransactionReference/></common:Response><rate:RatedShipment><rate:Service><rate:Code>03</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>4.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>25.82</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>25.82</rate:MonetaryValue></rate:TotalCharges><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>12.91</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>12.91</rate:MonetaryValue></rate:TotalCharges><rate:Weight>1.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>12.91</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>12.91</rate:MonetaryValue></rate:TotalCharges><rate:Weight>2.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>12</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>4.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>37.78</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>37.78</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>3</rate:BusinessDaysInTransit></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>18.89</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>18.89</rate:MonetaryValue></rate:TotalCharges><rate:Weight>1.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>18.89</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>18.89</rate:MonetaryValue></rate:TotalCharges><rate:Weight>2.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>02</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>4.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>49.18</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>49.18</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>2</rate:BusinessDaysInTransit></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>24.59</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>24.59</rate:MonetaryValue></rate:TotalCharges><rate:Weight>1.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>24.59</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>24.59</rate:MonetaryValue></rate:TotalCharges><rate:Weight>2.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>13</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>4.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>118.90</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>118.90</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>1</rate:BusinessDaysInTransit></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>59.45</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>59.45</rate:MonetaryValue></rate:TotalCharges><rate:Weight>1.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>59.45</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>59.45</rate:MonetaryValue></rate:TotalCharges><rate:Weight>2.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>14</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>4.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>187.36</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>187.36</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>1</rate:BusinessDaysInTransit><rate:DeliveryByTime>8:00 A.M.</rate:DeliveryByTime></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>93.68</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>93.68</rate:MonetaryValue></rate:TotalCharges><rate:Weight>1.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>93.68</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>93.68</rate:MonetaryValue></rate:TotalCharges><rate:Weight>2.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment><rate:RatedShipment><rate:Service><rate:Code>01</rate:Code><rate:Description/></rate:Service><rate:RatedShipmentAlert><rate:Code>110971</rate:Code><rate:Description>Your invoice may vary from the displayed reference rates</rate:Description></rate:RatedShipmentAlert><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>4.0</rate:Weight></rate:BillingWeight><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>125.40</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>125.40</rate:MonetaryValue></rate:TotalCharges><rate:GuaranteedDelivery><rate:BusinessDaysInTransit>1</rate:BusinessDaysInTransit><rate:DeliveryByTime>10:30 A.M.</rate:DeliveryByTime></rate:GuaranteedDelivery><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>62.70</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>62.70</rate:MonetaryValue></rate:TotalCharges><rate:Weight>1.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage><rate:RatedPackage><rate:TransportationCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>62.70</rate:MonetaryValue></rate:TransportationCharges><rate:ServiceOptionsCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>0.00</rate:MonetaryValue></rate:ServiceOptionsCharges><rate:TotalCharges><rate:CurrencyCode>USD</rate:CurrencyCode><rate:MonetaryValue>62.70</rate:MonetaryValue></rate:TotalCharges><rate:Weight>2.0</rate:Weight><rate:BillingWeight><rate:UnitOfMeasurement><rate:Code>LBS</rate:Code><rate:Description>Pounds</rate:Description></rate:UnitOfMeasurement><rate:Weight>2.0</rate:Weight></rate:BillingWeight></rate:RatedPackage></rate:RatedShipment></rate:RateResponse></soapenv:Body></soapenv:Envelope>
